In [14]:
import sqlalchemy
import pandas as pd
import numpy as np

In [15]:
engine = sqlalchemy.create_engine("mysql://admin:M0ZtDjLgAmj8D0LzAksT@cx4242.c55yrwcgiytm.us-east-1.rds.amazonaws.com/cx4242")
conn = engine.connect()

In [16]:
pd.read_sql("DESCRIBE citibike", conn)

                      Field        Type Null  Key Default Extra
0                     index  bigint(20)  YES  MUL    None
1              tripduration  bigint(20)  YES         None
2                 starttime        text  YES         None
3                  stoptime        text  YES         None
4          start station id  bigint(20)  YES         None
5        start station name        text  YES         None
6    start station latitude      double  YES         None
7   start station longitude      double  YES         None
8            end station id  bigint(20)  YES         None
9          end station name        text  YES         None
10     end station latitude      double  YES         None
11    end station longitude      double  YES         None
12                   bikeid  bigint(20)  YES         None
13                 usertype        text  YES         None
14               birth year  bigint(20)  YES         None
15                   gender  bigint(20)  YES         None

In [50]:
pd.read_sql("SHOW TABLES", conn)

  Tables_in_cx4242
0        OSM_nodes
1         OSM_ways
2         citibike
3             uber

In [52]:
pd.read_sql("SELECT * from uber limit 5", conn)

,year,month,day,hour,time,segment_id,start_junction_id,end_junction_id,speed_mph_mean,speed_mph_stddev
0,2019,4,26,11,2019-04-26 15:00:00,182d8ea1503e2c6687f1c49a692e84ef3212b1e3,cd8b7c3fcc1ba531b0012611d40390ebd73fd05e,3bdb3c6720ac8ed56abe2b7382db21b05bb8a1bc,28.272,6.031
1,2019,4,26,18,2019-04-26 22:00:00,182d8ea1503e2c6687f1c49a692e84ef3212b1e3,cd8b7c3fcc1ba531b0012611d40390ebd73fd05e,3bdb3c6720ac8ed56abe2b7382db21b05bb8a1bc,26.155,3.738
2,2019,4,20,16,2019-04-20 20:00:00,182d8ea1503e2c6687f1c49a692e84ef3212b1e3,cd8b7c3fcc1ba531b0012611d40390ebd73fd05e,3bdb3c6720ac8ed56abe2b7382db21b05bb8a1bc,23.024,6.918
3,2019,4,28,12,2019-04-28 16:00:00,182d8ea1503e2c6687f1c49a692e84ef3212b1e3,cd8b7c3fcc1ba531b0012611d40390ebd73fd05e,3bdb3c6720ac8ed56abe2b7382db21b05bb8a1bc,27.725,2.968
4,2019,4,3,18,2019-04-03 22:00:00,182d8ea1503e2c6687f1c49a692e84ef3212b1e3,cd8b7c3fcc1ba531b0012611d40390ebd73fd05e,3bdb3c6720ac8ed56abe2b7382db21b05bb8a1bc,25.429,4.516

In [53]:
pd.read_sql("select * from OSM_nodes limit 5", conn)

                                junction_id osm_node_id
0  c2584dab13fc7e96dc9a3b3c59cc7f7a2977db16  4374613431
1  0de9ea3af5a8528fd39e967f754a8d99a3ad263a    42830605
2  63365b0798cfdd824caa5f67175a75bda00ada9d  4205184438
3  2772fb90b5fa187c96bff4abe57bfaedb10d3484    42428024
4  13c7ebb4db8f7f4557d361cac1afcec1e607d2d3  3788308925

In [ ]:
pd.read_sql("SELECT * from uber \
            join (select junction_id as start_junction_id, osm_node_id as start_osm_node from OSM_nodes) as start_osm_nodes\
                on  start_osm_nodes.start_junction_id=uber.start_junction_id \
            join (select junction_id as end_junction_id, osm_node_id as end_osm_node from OSM_nodes) as end_osm_nodes \
                on  end_osm_nodes.end_junction_id=uber.end_junction_id \
             limit 5", conn)